In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
!type textbook\examples\ex1.csv

a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [4]:
df = pd.read_csv("textbook/examples/ex1.csv")

In [5]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [6]:
!type textbook\examples\ex2.csv

1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [7]:
pd.read_csv("textbook/examples/ex2.csv", header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [8]:
pd.read_csv("textbook/examples/ex2.csv", names=["a", "b", "c", "d", "message" ])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [9]:
names = ["a", "b", "c", "d", "message"]

In [10]:
pd.read_csv("textbook/examples/ex2.csv", names=names, index_col="message")

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [11]:
!type textbook\examples\csv_mindex.csv

key1,key2,value1,value2
one,a,1,2
one,b,3,4
one,c,5,6
one,d,7,8
two,a,9,10
two,b,11,12
two,c,13,14
two,d,15,16

In [12]:
parsed = pd.read_csv("textbook/examples/csv_mindex.csv", index_col=["key1", "key2"])

In [13]:
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [14]:
!type textbook\examples\ex3.txt

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [15]:
result = pd.read_csv("textbook/examples/ex3.txt", sep="\s+")

<>:1: SyntaxWarning: invalid escape sequence '\s'
<>:1: SyntaxWarning: invalid escape sequence '\s'
C:\Users\TRUTH\AppData\Local\Temp\ipykernel_7260\3931725404.py:1: SyntaxWarning: invalid escape sequence '\s'
  result = pd.read_csv("textbook/examples/ex3.txt", sep="\s+")

In [16]:
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [17]:
!type textbook\examples\ex4.csv

# hey!
a,b,c,d,message
# just wanted to make things more difficult for you
# who reads CSV files with computers, anyway?
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [18]:
pd.read_csv("textbook/examples/ex4.csv", skiprows=[0,2,3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [19]:
!type textbook\examples\ex5.csv

something,a,b,c,d,message
one,1,2,3,4,NA
two,5,6,,8,world
three,9,10,11,12,foo

In [20]:
result = pd.read_csv("textbook/examples/ex5.csv")

In [21]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [22]:
pd.isna(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [23]:
result = pd.read_csv("textbook/examples/ex5.csv", na_values=["NULL"])

In [24]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [25]:
result2 = pd.read_csv("textbook/examples/ex5.csv", keep_default_na=False)

In [26]:
result2

  something  a   b   c   d message
0       one  1   2   3   4      NA
1       two  5   6       8   world
2     three  9  10  11  12     foo

In [27]:
result2.isna()

   something      a      b      c      d  message
0      False  False  False  False  False    False
1      False  False  False  False  False    False
2      False  False  False  False  False    False

In [28]:
result3 = pd.read_csv("textbook/examples/ex5.csv", keep_default_na = False,
                      na_values = ["NA"])

In [29]:
result3

  something  a   b   c   d message
0       one  1   2   3   4     NaN
1       two  5   6       8   world
2     three  9  10  11  12     foo

In [30]:
result3.isna()

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False  False  False    False
2      False  False  False  False  False    False

In [31]:
sentinels = {"message": ["foo", "NA"], "something": ["two"]}

In [32]:
pd.read_csv("textbook/examples/ex5.csv", na_values = sentinels, 
            keep_default_na = False)

  something  a   b   c   d message
0       one  1   2   3   4     NaN
1       NaN  5   6       8   world
2     three  9  10  11  12     NaN

In [33]:
pd.options.display.max_rows=10

In [34]:
result=pd.read_csv("textbook/examples/ex6.csv")

In [35]:
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [36]:
pd.read_csv("textbook/examples/ex6.csv", nrows=5)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [37]:
chunker = pd.read_csv("textbook/examples/ex6.csv", chunksize=1000)

In [38]:
type(chunker)

pandas.io.parsers.readers.TextFileReader

In [39]:
tot = pd.Series([], dtype='int64')

In [40]:
for piece in chunker:
    tot = tot.add(piece["key"].value_counts(), fill_value=0)

In [41]:
tot = tot.sort_values(ascending = False)

In [42]:
tot[:20]

key
E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
     ...
A    320.0
R    318.0
Y    314.0
G    308.0
S    308.0
Length: 20, dtype: float64

In [43]:
data = pd.read_csv("textbook/examples/ex5.csv")

In [44]:
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [45]:
data.to_csv("textbook/examples/out.csv")

In [46]:
import sys

In [47]:
data.to_csv(sys.stdout, sep="|")

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [48]:
data.to_csv(sys.stdout, na_rep="NULL")

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

In [49]:
data.to_csv(sys.stdout, index=False, header=False)

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

In [50]:
data.to_csv(sys.stdout, index=False, columns=["a", "b", "c"])

a,b,c
1,2,3.0
5,6,
9,10,11.0

In [51]:
f = open("textbook/examples/ex7.csv")

In [52]:
reader = csv.reader(f)

NameError: name 'csv' is not defined

In [ ]:
for line in reader:
    print(line)

In [ ]:
f.close()

In [ ]:
with open("textbook/examples/ex7.csv") as f:
          lines = list(csv.reader(f))

In [ ]:
header, values = lines[0], lines[1:]

In [ ]:
data_dict = {h: v for h, v in zip(header, zip(*values))}

In [ ]:
data_dict

In [ ]:
class my_dialect(csv.Dialect):
    lineterminator = "\n"
    delimiter = ";"
    quotechar = '"'
    quoting = csv.QUOTE_MINIMAL

In [ ]:

reader = csv.reader(f, dialect=my_dialect) #idk i followed alone, ig bc of the f.close()

In [ ]:
with open("mydata.csv", "w") as f:
    writer = csv.writer(f, dialect=my_dialect)
    writer.writerow(("one", "two", "three"))
    writer.writerow(("1", "2", "3"))
    writer.writerow(("4", "5", "6"))
    writer.writerow(("7", "8", "9"))

In [ ]:
!type mydata.csv

In [ ]:
obj = """
{"name": "Wes",
 "cities_lived": ["Akron", "Nashville", "New York", "San Francisco"],
 "pet": null,
 "siblings": [{"name": "Scott", "age": 34, "hobbies": ["guitars", "soccer"]},
              {"name": "Katie", "age": 42, "hobbies": ["diving", "art"]}]
}
"""

In [ ]:
import json

In [ ]:
result = json.loads(obj)

In [ ]:
result

In [ ]:
asjson = json.dumps(result)

In [ ]:
asjson

In [ ]:
siblings = pd.DataFrame(result["siblings"], columns=["name", "age"])

In [ ]:
siblings

In [ ]:
!type textbook\examples\example.json

In [ ]:
data = pd.read_json("textbook/examples/example.json")

In [ ]:
data

In [53]:
tables = pd.read_html("textbook/examples/fdic_failed_bank_list.html")

In [54]:
len(tables)

1

In [55]:
failures = tables[0]

In [56]:
failures.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"

In [57]:
close_timestamps = pd.to_datetime(failures["Closing Date"])

In [58]:
close_timestamps.dt.year.value_counts()

Closing Date
2010    157
2009    140
2011     92
2012     51
2008     25
       ...
2004      4
2001      4
2007      3
2003      3
2000      2
Name: count, Length: 15, dtype: int64

In [59]:
from lxml import objectify

In [61]:
path = "textbook/datasets/mta_perf/Performance_MNR.xml"

In [62]:
with open(path) as f:
    parsed = objectify.parse(f)

In [63]:
root = parsed.getroot()

In [64]:
data = []

In [65]:
skip_fields = ["PARENT_SEQ", "INDICATOR_SEQ",
               "DESIRED_CHANGE", "DECIMAL_PLACES"]

In [67]:
for elt in root.INDICATOR:
    el_data = {}
    for child in elt.getchildren():
        if child.tag in skip_fields:
            continue
        el_data[child.tag] = child.pyval
    data.append(el_data)

In [68]:
perf = pd.DataFrame(data)

In [69]:
perf.head()

,AGENCY_NAME,INDICATOR_NAME,DESCRIPTION,PERIOD_YEAR,PERIOD_MONTH,CATEGORY,FREQUENCY,INDICATOR_UNIT,YTD_TARGET,YTD_ACTUAL,MONTHLY_TARGET,MONTHLY_ACTUAL
0,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,1,Service Indicators,M,%,95.0,96.9,95.0,96.9
1,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,2,Service Indicators,M,%,95.0,96.0,95.0,95.0
2,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,3,Service Indicators,M,%,95.0,96.3,95.0,96.9
3,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,4,Service Indicators,M,%,95.0,96.8,95.0,98.3
4,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,5,Service Indicators,M,%,95.0,96.6,95.0,95.8

In [70]:
perf2 = pd.read_xml(path)

In [71]:
perf2.head()

,INDICATOR_SEQ,PARENT_SEQ,AGENCY_NAME,INDICATOR_NAME,DESCRIPTION,PERIOD_YEAR,PERIOD_MONTH,CATEGORY,FREQUENCY,DESIRED_CHANGE,INDICATOR_UNIT,DECIMAL_PLACES,YTD_TARGET,YTD_ACTUAL,MONTHLY_TARGET,MONTHLY_ACTUAL
0,28445,NaN,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,1,Service Indicators,M,U,%,1,95.00,96.90,95.00,96.90
1,28445,NaN,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,2,Service Indicators,M,U,%,1,95.00,96.00,95.00,95.00
2,28445,NaN,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,3,Service Indicators,M,U,%,1,95.00,96.30,95.00,96.90
3,28445,NaN,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,4,Service Indicators,M,U,%,1,95.00,96.80,95.00,98.30
4,28445,NaN,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,5,Service Indicators,M,U,%,1,95.00,96.60,95.00,95.80

In [73]:
frame = pd.read_csv("textbook/examples/ex1.csv")

In [74]:
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [76]:
frame.to_pickle("textbook/examples/frame_pickle")

In [77]:
pd.read_pickle("textbook/examples/frame_pickle")

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [79]:
xlsx = pd.ExcelFile("textbook/examples/ex1.xlsx")

In [80]:
xlsx.sheet_names

['Sheet1']

In [81]:
xlsx.parse(sheet_name="Sheet1")

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [82]:
xlsx.parse(sheet_name="Sheet1", index_col=0)

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [83]:
frame = pd.read_excel("textbook/examples/ex1.xlsx", sheet_name="Sheet1")

In [84]:
frame

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [85]:
writer = pd.ExcelWriter("textbook/examples/ex2.xlsx")

In [86]:
frame.to_excel(writer, "Sheet1")

C:\Users\TRUTH\AppData\Local\Temp\ipykernel_7260\2112036528.py:1: FutureWarning: Starting with pandas version 3.0 all arguments of to_excel except for the argument 'excel_writer' will be keyword-only.
  frame.to_excel(writer, "Sheet1")

In [87]:
writer.close()

In [89]:
frame.to_excel("textbook/examples/ex2.xlsx")

In [90]:
import requests

In [91]:
url = "https://api.github.com/repos/pandas-dev/pandas/issues"

In [92]:
resp = requests.get(url)

In [93]:
resp.raise_for_status()

In [94]:
resp

In [95]:
data = resp.json()

In [96]:
data[0]["title"]

'DOC: fix formatting of date_format special options'

In [98]:
issues = pd.DataFrame(data, columns=["number", "title",
                                    "labels", "state"])

In [99]:
issues

,number,title,labels,state
0,58740,DOC: fix formatting of date_format special opt...,[],open
1,58739,CLN: Require ExtensionArray._reduce(keepdims=),"[{'id': 211029535, 'node_id': 'MDU6TGFiZWwyMTE...",open
2,58737,"BUG: ""styler.format.thousands"" option doesn't ...","[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
3,58734,ENH: Python 3.13 support,"[{'id': 76812, 'node_id': 'MDU6TGFiZWw3NjgxMg=...",open
4,58732,Dep groupby corrwith,"[{'id': 233160, 'node_id': 'MDU6TGFiZWwyMzMxNj...",open
...,...,...,...,...
25,58663,REF/API: make construct_array_type a non-class...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
26,58651,"Potential regression induced by ""BUG: Use larg...","[{'id': 32815646, 'node_id': 'MDU6TGFiZWwzMjgx...",open
27,58648,ENH: Add paramenter `index` to `drop_duplicate...,"[{'id': 76812, 'node_id': 'MDU6TGFiZWw3NjgxMg=...",open
28,58647,"BLD, CI: Upload Emscripten/Pyodide nightlies t...","[{'id': 129350, 'node_id': 'MDU6TGFiZWwxMjkzNT...",open
29,58645,CLN: Stopped casting values in Series/Index.is...,"[{'id': 211029535, 'node_id': 'MDU6TGFiZWwyMTE...",open

In [100]:
import sqlite3

In [101]:
query = """CREATE TABLE test
        (a VARCHAR(20), b VARCHAR(20),
         c REAL,        d INTEGER
        );"""

In [102]:
con = sqlite3.connect("mydata.sqlite")

In [103]:
con.execute(query)

In [104]:
con.commit()

In [105]:
data = [("Atlanta", "Georgia", 1.25, 6),
            ("Tallahassee", "Florida", 2.6, 3),
            ("Sacramento", "California", 1.7, 5)]

In [106]:
stmt = "INSERT INTO test VALUES(?, ?, ?, ?)"

In [107]:
con.executemany(stmt, data)

In [108]:
con.commit()

In [109]:
cursor = con.execute("SELECT * FROM test")

In [110]:
rows = cursor.fetchall()

In [111]:
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [112]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [113]:
pd.DataFrame(rows, columns=[x[0] for x in cursor.description])

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5

In [115]:
import sqlalchemy as sqla

In [116]:
db = sqla.create_engine("sqlite:///mydata.sqlite")

In [117]:
pd.read_sql("SELECT * FROM test", db)

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5